7767517
138 154
Input            input                    0 1 input
Convolution      301                      1 1 input 301 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216
ReLU             303                      1 1 301 303
ConvolutionDepthWise 304                      1 1 303 304 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             306                      1 1 304 306
Convolution      307                      1 1 306 307 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ReLU             309                      1 1 307 309
ConvolutionDepthWise 310                      1 1 309 310 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             312                      1 1 310 312
Convolution      313                      1 1 312 313 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             315                      1 1 313 315
ConvolutionDepthWise 316                      1 1 315 316 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             318                      1 1 316 318
Convolution      319                      1 1 318 319 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             321                      1 1 319 321
ConvolutionDepthWise 322                      1 1 321 322 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             324                      1 1 322 324
Convolution      325                      1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             327                      1 1 325 327
ConvolutionDepthWise 328                      1 1 327 328 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             330                      1 1 328 330
Convolution      331                      1 1 330 331 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             333                      1 1 331 333
Split            splitncnn_0              1 2 333 333_splitncnn_0 333_splitncnn_1
ConvolutionDepthWise 334                      1 1 333_splitncnn_1 334 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             336                      1 1 334 336
Convolution      337                      1 1 336 337 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             339                      1 1 337 339
ConvolutionDepthWise 340                      1 1 339 340 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             342                      1 1 340 342
Convolution      343                      1 1 342 343 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             345                      1 1 343 345
ConvolutionDepthWise 346                      1 1 345 346 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             348                      1 1 346 348
Convolution      349                      1 1 348 349 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             351                      1 1 349 351
ConvolutionDepthWise 352                      1 1 351 352 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             354                      1 1 352 354
Convolution      355                      1 1 354 355 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             357                      1 1 355 357
ConvolutionDepthWise 358                      1 1 357 358 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             360                      1 1 358 360
Convolution      361                      1 1 360 361 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             363                      1 1 361 363
ConvolutionDepthWise 364                      1 1 363 364 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             366                      1 1 364 366
Convolution      367                      1 1 366 367 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             369                      1 1 367 369
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
ConvolutionDepthWise 370                      1 1 369_splitncnn_1 370 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             372                      1 1 370 372
Convolution      373                      1 1 372 373 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             375                      1 1 373 375
ConvolutionDepthWise 376                      1 1 375 376 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             378                      1 1 376 378
Convolution      379                      1 1 378 379 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             381                      1 1 379 381
Convolution      382                      1 1 333_splitncnn_0 382 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             384                      1 1 382 384
Convolution      385                      1 1 369_splitncnn_0 385 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             387                      1 1 385 387
Convolution      388                      1 1 381 388 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             390                      1 1 388 390
Split            splitncnn_2              1 3 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2
Interp           404                      1 1 390_splitncnn_2 404 0=1 1=1.000000e+00 2=1.000000e+00
BinaryOp         405                      2 1 387 404 405 0=0
Convolution      406                      1 1 405 406 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             408                      1 1 406 408
Split            splitncnn_3              1 3 408 408_splitncnn_0 408_splitncnn_1 408_splitncnn_2
Interp           422                      1 1 408_splitncnn_2 422 0=1 1=1.000000e+00 2=1.000000e+00
BinaryOp         423                      2 1 384 422 423 0=0
Convolution      424                      1 1 423 424 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             426                      1 1 424 426
Split            splitncnn_4              1 2 426 426_splitncnn_0 426_splitncnn_1
Convolution      427                      1 1 426_splitncnn_1 427 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      429                      1 1 426_splitncnn_0 429 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             431                      1 1 429 431
Split            splitncnn_5              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution      432                      1 1 431_splitncnn_1 432 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      434                      1 1 431_splitncnn_0 434 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             436                      1 1 434 436
Convolution      437                      1 1 436 437 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           439                      3 1 427 432 437 439 0=0
ReLU             440                      1 1 439 440
Split            splitncnn_6              1 3 440 440_splitncnn_0 440_splitncnn_1 440_splitncnn_2
Convolution      441                      1 1 408_splitncnn_1 441 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      443                      1 1 408_splitncnn_0 443 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             445                      1 1 443 445
Split            splitncnn_7              1 2 445 445_splitncnn_0 445_splitncnn_1
Convolution      446                      1 1 445_splitncnn_1 446 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      448                      1 1 445_splitncnn_0 448 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             450                      1 1 448 450
Convolution      451                      1 1 450 451 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           453                      3 1 441 446 451 453 0=0
ReLU             454                      1 1 453 454
Split            splitncnn_8              1 3 454 454_splitncnn_0 454_splitncnn_1 454_splitncnn_2
Convolution      455                      1 1 390_splitncnn_1 455 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      457                      1 1 390_splitncnn_0 457 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             459                      1 1 457 459
Split            splitncnn_9              1 2 459 459_splitncnn_0 459_splitncnn_1
Convolution      460                      1 1 459_splitncnn_1 460 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      462                      1 1 459_splitncnn_0 462 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             464                      1 1 462 464
Convolution      465                      1 1 464 465 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           467                      3 1 455 460 465 467 0=0
ReLU             468                      1 1 467 468
Split            splitncnn_10             1 3 468 468_splitncnn_0 468_splitncnn_1 468_splitncnn_2
Convolution      469                      1 1 440_splitncnn_2 469 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          470                      1 1 469 470 0=3
Reshape          480                      1 1 470 480 0=4 1=-1
Convolution      481                      1 1 454_splitncnn_2 481 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          482                      1 1 481 482 0=3
Reshape          492                      1 1 482 492 0=4 1=-1
Convolution      493                      1 1 468_splitncnn_2 493 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          494                      1 1 493 494 0=3
Reshape          504                      1 1 494 504 0=4 1=-1
Concat           loc                      3 1 480 492 504 loc 0=0
Convolution      506                      1 1 440_splitncnn_1 506 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          507                      1 1 506 507 0=3
Reshape          517                      1 1 507 517 0=2 1=-1
Convolution      518                      1 1 454_splitncnn_1 518 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          519                      1 1 518 519 0=3
Reshape          529                      1 1 519 529 0=2 1=-1
Convolution      530                      1 1 468_splitncnn_1 530 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Permute          531                      1 1 530 531 0=3
Reshape          541                      1 1 531 541 0=2 1=-1
Concat           542                      3 1 517 529 541 542 0=0
Convolution      543                      1 1 440_splitncnn_0 543 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          544                      1 1 543 544 0=3
Reshape          554                      1 1 544 554 0=10 1=-1
Convolution      555                      1 1 454_splitncnn_0 555 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          556                      1 1 555 556 0=3
Reshape          566                      1 1 556 566 0=10 1=-1
Convolution      567                      1 1 468_splitncnn_0 567 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Permute          568                      1 1 567 568 0=3
Reshape          578                      1 1 568 578 0=10 1=-1
Concat           landmks                  3 1 554 566 578 landmks 0=0
Softmax          conf                     1 1 542 conf 0=1 1=1
