7767517
223 248
Input            input                    0 1 input
Input            face_feature             0 1 face_feature
Convolution      373                      1 1 input 373 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=1 16=1 5=1 6=864
HardSwish        380                      1 1 373 380 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 382                      1 1 380 382 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
HardSwish        389                      1 1 382 389 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 389 389_splitncnn_0 389_splitncnn_1
Pooling          390                      1 1 389_splitncnn_1 390 0=1 4=1
Convolution      391                      1 1 390 391 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
HardSwish        397                      1 1 391 397 0=1.666667e-01 1=5.000000e-01
Convolution      398                      1 1 397 398 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Sigmoid          399                      1 1 398 399
BinaryOp         400                      2 1 399 389_splitncnn_0 400 0=2
Convolution      401                      1 1 400 401 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      403                      1 1 401 403 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
HardSwish        410                      1 1 403 410 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 412                      1 1 410 412 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=1 16=1 5=1 6=864 7=96
HardSwish        419                      1 1 412 419 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_1              1 2 419 419_splitncnn_0 419_splitncnn_1
Pooling          420                      1 1 419_splitncnn_1 420 0=1 4=1
Convolution      421                      1 1 420 421 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
HardSwish        427                      1 1 421 427 0=1.666667e-01 1=5.000000e-01
Convolution      428                      1 1 427 428 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
Sigmoid          429                      1 1 428 429
BinaryOp         430                      2 1 429 419_splitncnn_0 430 0=2
Convolution      431                      1 1 430 431 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_2              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution      433                      1 1 431_splitncnn_1 433 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
HardSwish        440                      1 1 433 440 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 442                      1 1 440 442 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
HardSwish        449                      1 1 442 449 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_3              1 2 449 449_splitncnn_0 449_splitncnn_1
Pooling          450                      1 1 449_splitncnn_1 450 0=1 4=1
Convolution      451                      1 1 450 451 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
HardSwish        457                      1 1 451 457 0=1.666667e-01 1=5.000000e-01
Convolution      458                      1 1 457 458 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
Sigmoid          459                      1 1 458 459
BinaryOp         460                      2 1 459 449_splitncnn_0 460 0=2
Convolution      461                      1 1 460 461 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         463                      2 1 461 431_splitncnn_0 463 0=0
Convolution      464                      1 1 463 464 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
HardSwish        471                      1 1 464 471 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 473                      1 1 471 473 0=144 1=5 11=5 2=1 12=1 3=2 13=2 4=1 14=1 15=2 16=2 5=1 6=3600 7=144
HardSwish        480                      1 1 473 480 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_4              1 2 480 480_splitncnn_0 480_splitncnn_1
Pooling          481                      1 1 480_splitncnn_1 481 0=1 4=1
Convolution      482                      1 1 481 482 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
HardSwish        488                      1 1 482 488 0=1.666667e-01 1=5.000000e-01
Convolution      489                      1 1 488 489 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=864
Sigmoid          490                      1 1 489 490
BinaryOp         491                      2 1 490 480_splitncnn_0 491 0=2
Convolution      492                      1 1 491 492 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Split            splitncnn_5              1 2 492 492_splitncnn_0 492_splitncnn_1
Convolution      494                      1 1 492_splitncnn_1 494 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        501                      1 1 494 501 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 503                      1 1 501 503 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        510                      1 1 503 510 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_6              1 2 510 510_splitncnn_0 510_splitncnn_1
Pooling          511                      1 1 510_splitncnn_1 511 0=1 4=1
Convolution      512                      1 1 511 512 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
HardSwish        518                      1 1 512 518 0=1.666667e-01 1=5.000000e-01
Convolution      519                      1 1 518 519 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
Sigmoid          520                      1 1 519 520
BinaryOp         521                      2 1 520 510_splitncnn_0 521 0=2
Convolution      522                      1 1 521 522 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
BinaryOp         524                      2 1 522 492_splitncnn_0 524 0=0
Convolution      525                      1 1 524 525 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        532                      1 1 525 532 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 534                      1 1 532 534 0=240 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=1 16=1 5=1 6=2160 7=240
HardSwish        541                      1 1 534 541 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_7              1 2 541 541_splitncnn_0 541_splitncnn_1
Pooling          542                      1 1 541_splitncnn_1 542 0=1 4=1
Convolution      543                      1 1 542 543 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
HardSwish        549                      1 1 543 549 0=1.666667e-01 1=5.000000e-01
Convolution      550                      1 1 549 550 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
Sigmoid          551                      1 1 550 551
BinaryOp         552                      2 1 551 541_splitncnn_0 552 0=2
Convolution      553                      1 1 552 553 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19200
Split            splitncnn_8              1 2 553 553_splitncnn_0 553_splitncnn_1
Convolution      555                      1 1 553_splitncnn_1 555 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        562                      1 1 555 562 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 564                      1 1 562 564 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
HardSwish        571                      1 1 564 571 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_9              1 2 571 571_splitncnn_0 571_splitncnn_1
Pooling          572                      1 1 571_splitncnn_1 572 0=1 4=1
Convolution      573                      1 1 572 573 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        579                      1 1 573 579 0=1.666667e-01 1=5.000000e-01
Convolution      580                      1 1 579 580 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Sigmoid          581                      1 1 580 581
BinaryOp         582                      2 1 581 571_splitncnn_0 582 0=2
Convolution      583                      1 1 582 583 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
BinaryOp         585                      2 1 583 553_splitncnn_0 585 0=0
Split            splitncnn_10             1 2 585 585_splitncnn_0 585_splitncnn_1
Convolution      586                      1 1 585_splitncnn_1 586 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        593                      1 1 586 593 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 595                      1 1 593 595 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
HardSwish        602                      1 1 595 602 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_11             1 2 602 602_splitncnn_0 602_splitncnn_1
Pooling          603                      1 1 602_splitncnn_1 603 0=1 4=1
Convolution      604                      1 1 603 604 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        610                      1 1 604 610 0=1.666667e-01 1=5.000000e-01
Convolution      611                      1 1 610 611 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Sigmoid          612                      1 1 611 612
BinaryOp         613                      2 1 612 602_splitncnn_0 613 0=2
Convolution      614                      1 1 613 614 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
BinaryOp         616                      2 1 614 585_splitncnn_0 616 0=0
Convolution      617                      1 1 616 617 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        624                      1 1 617 624 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 626                      1 1 624 626 0=480 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=12000 7=480
HardSwish        633                      1 1 626 633 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_12             1 2 633 633_splitncnn_0 633_splitncnn_1
Pooling          634                      1 1 633_splitncnn_1 634 0=1 4=1
Convolution      635                      1 1 634 635 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        641                      1 1 635 641 0=1.666667e-01 1=5.000000e-01
Convolution      642                      1 1 641 642 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Sigmoid          643                      1 1 642 643
BinaryOp         644                      2 1 643 633_splitncnn_0 644 0=2
Convolution      645                      1 1 644 645 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53760
Split            splitncnn_13             1 2 645 645_splitncnn_0 645_splitncnn_1
Convolution      647                      1 1 645_splitncnn_1 647 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        654                      1 1 647 654 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 656                      1 1 654 656 0=672 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=16800 7=672
HardSwish        663                      1 1 656 663 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_14             1 2 663 663_splitncnn_0 663_splitncnn_1
Pooling          664                      1 1 663_splitncnn_1 664 0=1 4=1
Convolution      665                      1 1 664 665 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
HardSwish        671                      1 1 665 671 0=1.666667e-01 1=5.000000e-01
Convolution      672                      1 1 671 672 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
Sigmoid          673                      1 1 672 673
BinaryOp         674                      2 1 673 663_splitncnn_0 674 0=2
Convolution      675                      1 1 674 675 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
BinaryOp         677                      2 1 675 645_splitncnn_0 677 0=0
Split            splitncnn_15             1 2 677 677_splitncnn_0 677_splitncnn_1
Convolution      678                      1 1 677_splitncnn_1 678 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        685                      1 1 678 685 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 687                      1 1 685 687 0=672 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=16800 7=672
HardSwish        694                      1 1 687 694 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_16             1 2 694 694_splitncnn_0 694_splitncnn_1
Pooling          695                      1 1 694_splitncnn_1 695 0=1 4=1
Convolution      696                      1 1 695 696 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
HardSwish        702                      1 1 696 702 0=1.666667e-01 1=5.000000e-01
Convolution      703                      1 1 702 703 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
Sigmoid          704                      1 1 703 704
BinaryOp         705                      2 1 704 694_splitncnn_0 705 0=2
Convolution      706                      1 1 705 706 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
BinaryOp         708                      2 1 706 677_splitncnn_0 708 0=0
Convolution      709                      1 1 708 709 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        716                      1 1 709 716 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 718                      1 1 716 718 0=672 1=5 11=5 2=1 12=1 3=2 13=2 4=1 14=1 15=2 16=2 5=1 6=16800 7=672
HardSwish        725                      1 1 718 725 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_17             1 2 725 725_splitncnn_0 725_splitncnn_1
Pooling          726                      1 1 725_splitncnn_1 726 0=1 4=1
Convolution      727                      1 1 726 727 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
HardSwish        733                      1 1 727 733 0=1.666667e-01 1=5.000000e-01
Convolution      734                      1 1 733 734 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=18816
Sigmoid          735                      1 1 734 735
BinaryOp         736                      2 1 735 725_splitncnn_0 736 0=2
Convolution      737                      1 1 736 737 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=129024
Split            splitncnn_18             1 2 737 737_splitncnn_0 737_splitncnn_1
Convolution      739                      1 1 737_splitncnn_1 739 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
HardSwish        746                      1 1 739 746 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 748                      1 1 746 748 0=1152 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=28800 7=1152
HardSwish        755                      1 1 748 755 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_19             1 2 755 755_splitncnn_0 755_splitncnn_1
Pooling          756                      1 1 755_splitncnn_1 756 0=1 4=1
Convolution      757                      1 1 756 757 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        763                      1 1 757 763 0=1.666667e-01 1=5.000000e-01
Convolution      764                      1 1 763 764 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Sigmoid          765                      1 1 764 765
BinaryOp         766                      2 1 765 755_splitncnn_0 766 0=2
Convolution      767                      1 1 766 767 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
BinaryOp         769                      2 1 767 737_splitncnn_0 769 0=0
Split            splitncnn_20             1 2 769 769_splitncnn_0 769_splitncnn_1
Convolution      770                      1 1 769_splitncnn_1 770 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
HardSwish        777                      1 1 770 777 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 779                      1 1 777 779 0=1152 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=28800 7=1152
HardSwish        786                      1 1 779 786 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_21             1 2 786 786_splitncnn_0 786_splitncnn_1
Pooling          787                      1 1 786_splitncnn_1 787 0=1 4=1
Convolution      788                      1 1 787 788 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        794                      1 1 788 794 0=1.666667e-01 1=5.000000e-01
Convolution      795                      1 1 794 795 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Sigmoid          796                      1 1 795 796
BinaryOp         797                      2 1 796 786_splitncnn_0 797 0=2
Convolution      798                      1 1 797 798 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
BinaryOp         800                      2 1 798 769_splitncnn_0 800 0=0
Split            splitncnn_22             1 2 800 800_splitncnn_0 800_splitncnn_1
Convolution      801                      1 1 800_splitncnn_1 801 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
HardSwish        808                      1 1 801 808 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 810                      1 1 808 810 0=1152 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=28800 7=1152
HardSwish        817                      1 1 810 817 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_23             1 2 817 817_splitncnn_0 817_splitncnn_1
Pooling          818                      1 1 817_splitncnn_1 818 0=1 4=1
Convolution      819                      1 1 818 819 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        825                      1 1 819 825 0=1.666667e-01 1=5.000000e-01
Convolution      826                      1 1 825 826 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Sigmoid          827                      1 1 826 827
BinaryOp         828                      2 1 827 817_splitncnn_0 828 0=2
Convolution      829                      1 1 828 829 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
BinaryOp         831                      2 1 829 800_splitncnn_0 831 0=0
Convolution      832                      1 1 831 832 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=221184
HardSwish        839                      1 1 832 839 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 841                      1 1 839 841 0=1152 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=10368 7=1152
HardSwish        848                      1 1 841 848 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_24             1 2 848 848_splitncnn_0 848_splitncnn_1
Pooling          849                      1 1 848_splitncnn_1 849 0=1 4=1
Convolution      850                      1 1 849 850 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        856                      1 1 850 856 0=1.666667e-01 1=5.000000e-01
Convolution      857                      1 1 856 857 0=1152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Sigmoid          858                      1 1 857 858
BinaryOp         859                      2 1 858 848_splitncnn_0 859 0=2
Convolution      860                      1 1 859 860 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=368640
Convolution      862                      1 1 860 862 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=409600
HardSwish        869                      1 1 862 869 0=1.666667e-01 1=5.000000e-01
Convolution      870                      1 1 869 870 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=163840
HardSwish        877                      1 1 870 877 0=1.666667e-01 1=5.000000e-01
Reshape          885                      1 1 877 885 0=-1
Concat           886                      2 1 885 face_feature 886 0=0
InnerProduct     887                      1 1 886 887 0=128 1=1 2=475136
HardSwish        893                      1 1 887 893 0=1.666667e-01 1=5.000000e-01
InnerProduct     894                      1 1 893 894 0=32 1=1 2=4096
HardSwish        900                      1 1 894 900 0=1.666667e-01 1=5.000000e-01
InnerProduct     gaze                     1 1 900 gaze 0=4 1=1 2=128
